Revit 2024 API
ExportPDFSettings.Create Method
 Returns an new created ExportPDFSettings element in the document with specified settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static ExportPDFSettings Create(
	Document document,
	string name,
	PDFExportOptions options
)
Visual Basic
Public Shared Function Create ( _
	document As Document, _
	name As String, _
	options As PDFExportOptions _
) As ExportPDFSettings
Visual C++
public:
static ExportPDFSettings^ Create(
	Document^ document,
	String^ name,
	PDFExportOptions^ options
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 Document where the settings will be created.
name
Type: System.String
 Name to the settings.
options
Type: Autodesk.Revit.DB.PDFExportOptions
 The options to be set.
Return Value
 New instance of ExportPDFSettings just created in the document.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  name is an empty string or contains only whitespace. -or- name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~". -or- Setting name.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
ExportPDFSettings Class
Autodesk.Revit.DB Namespace